RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/frdm-mcxa366/board/MCUX_Config/board/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/


#include "rtconfig.h"

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_edma.h"
#include "pin_mux.h"


void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

static void release_reset_array(const reset_ip_name_t *resets, uint32_t count)
{
    for (uint32_t i = 0; i < count; i++)
    {
        RESET_ReleasePeripheralReset(resets[i]);
    }
}

void BOARD_InitPins(void)
{
    static const clock_ip_name_t port_clocks[] = PORT_CLOCKS;
    static const clock_ip_name_t gpio_clocks[] = GPIO_CLOCKS;

    // Enable clocks
    for (uint32_t i = 0; i < ARRAY_SIZE(port_clocks); i++)
    {
        CLOCK_EnableClock(port_clocks[i]);
        CLOCK_EnableClock(gpio_clocks[i]);
    }

    // SDK predefined reset arrays
    static const reset_ip_name_t port_resets[] = PORT_RSTS_N;
    static const reset_ip_name_t gpio_resets[] = GPIO_RSTS_N;
    static const reset_ip_name_t uart_resets[] = LPUART_RSTS;
    static const reset_ip_name_t i2c_resets[] = LPI2C_RSTS;
    static const reset_ip_name_t spi_resets[] = LPSPI_RSTS;
    static const reset_ip_name_t dma_resets[] = DMA_RSTS_N;
    static const reset_ip_name_t can_resets[] = FLEXCAN_RSTS_N;

    // Release resets
    release_reset_array(port_resets, ARRAY_SIZE(port_resets));
    release_reset_array(gpio_resets, ARRAY_SIZE(gpio_resets));
    release_reset_array(uart_resets, ARRAY_SIZE(uart_resets));
    release_reset_array(i2c_resets, ARRAY_SIZE(i2c_resets));
    release_reset_array(spi_resets, ARRAY_SIZE(spi_resets));
    release_reset_array(dma_resets, ARRAY_SIZE(dma_resets));
    release_reset_array(can_resets, ARRAY_SIZE(can_resets));

    const port_pin_config_t port2_2_pin35_config = {/* Internal pull-up resistor is enabled */
                                                     .pullSelect = kPORT_PullUp,
                                                    /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                     .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPUART2_TXD */
                                                     .mux = kPORT_MuxAlt3,
                                                    /* Digital input enabled */
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                     .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = kPORT_UnlockRegister
    };
    /* PORT2_2 (pin 35) is configured as LPUART2_TXD */
    PORT_SetPinConfig(PORT2, 2U, &port2_2_pin35_config);

    const port_pin_config_t port2_3_pin36_config = {/* Internal pull-up resistor is enabled */
                                                     .pullSelect = kPORT_PullUp,
                                                    /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                     .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPUART2_RXD */
                                                     .mux = kPORT_MuxAlt3,
                                                    /* Digital input enabled */
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                     .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = kPORT_UnlockRegister
    };
    /* PORT2_3 (pin 36) is configured as LPUART2_RXD */
    PORT_SetPinConfig(PORT2, 3U, &port2_3_pin36_config);


