RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/frdm-mcxa366/board/MCUX_Config/board/pin_mux.c
    const port_pin_config_t LED_RED = {/* Internal pull-up/down resistor is disabled */
                                        .pullSelect = kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                        .slewRate = kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                        .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                        .openDrainEnable = kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                        .driveStrength = kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                        .driveStrength1 = kPORT_NormalDriveStrength,
                                       /* Pin is configured as P3_18 */
                                        .mux = kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                        .inputBuffer = kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                        .invertInput = kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = kPORT_UnlockRegister
    };
    /* PORT3_18 (pin 86) is configured as P3_18 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_RED_PORT, BOARD_INITLEDSPINS_LED_RED_PIN, &LED_RED);

    const port_pin_config_t LED_GREEN = {/* Internal pull-up/down resistor is disabled */
                                          .pullSelect = kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                          .pullValueSelect = kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                          .slewRate = kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                          .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                          .openDrainEnable = kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                          .driveStrength = kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                          .driveStrength1 = kPORT_NormalDriveStrength,
                                         /* Pin is configured as P3_19 */
                                          .mux = kPORT_MuxAlt0,
                                         /* Digital input enabled */
                                          .inputBuffer = kPORT_InputBufferEnable,
                                         /* Digital input is not inverted */
                                          .invertInput = kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                          .lockRegister = kPORT_UnlockRegister
    };
    /* PORT3_19 (pin 85) is configured as P3_19 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_GREEN_PORT, BOARD_INITLEDSPINS_LED_GREEN_PIN, &LED_GREEN);

    const port_pin_config_t LED_BLUE = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                         .slewRate = kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                         .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                         .openDrainEnable = kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                         .driveStrength = kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                         .driveStrength1 = kPORT_NormalDriveStrength,
                                        /* Pin is configured as P3_21 */
                                         .mux = kPORT_MuxAlt0,
                                        /* Digital input enabled */
                                         .inputBuffer = kPORT_InputBufferEnable,
                                        /* Digital input is not inverted */
                                         .invertInput = kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = kPORT_UnlockRegister
    };
    /* PORT3_21 (pin 82) is configured as P3_21 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_BLUE_PORT, BOARD_INITLEDSPINS_LED_BLUE_PIN, &LED_BLUE);


    const port_pin_config_t port1_8_pin1_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                   /* Pin is configured as LPI2C2_SDA */
                                                    .mux = kPORT_MuxAlt3,
                                                   /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                   /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister
    };
    /* PORT1_8 (pin 1) is configured as LPI2C2_SDA */
    PORT_SetPinConfig(PORT1, 8U, &port1_8_pin1_config);

    const port_pin_config_t port1_9_pin2_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                   /* Pin is configured as LPI2C2_SCL */
                                                    .mux = kPORT_MuxAlt3,
                                                   /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                   /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister
    };
    /* PORT1_9 (pin 2) is configured as LPI2C2_SCL */
    PORT_SetPinConfig(PORT1, 9U, &port1_9_pin2_config);

