RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/frdm-mcxa366/board/MCUX_Config/board/pin_mux.c
    const port_pin_config_t port1_2_pin137_config = {/* Internal pull-up/down resistor is disabled */
                                                      .pullSelect = kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                      .pullValueSelect = kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                      .slewRate = kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                      .driveStrength = kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                                     /* Pin is configured as CAN0_TXD */
                                                      .mux = kPORT_MuxAlt11,
                                                     /* Digital input enabled */
                                                      .inputBuffer = kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                      .invertInput = kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                      .lockRegister = kPORT_UnlockRegister
    };
    /* PORT1_2 (pin 137) is configured as CAN0_TXD */
    PORT_SetPinConfig(PORT1, 2U, &port1_2_pin137_config);

#ifdef BSP_USING_CAN1
    const port_pin_config_t port1_12_pin5_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = kPORT_PullDisable,
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                     .slewRate = kPORT_FastSlewRate,
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as CAN1_RXD */
                                                     .mux = kPORT_MuxAlt11,
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                     .invertInput = kPORT_InputNormal,
                                                     .lockRegister = kPORT_UnlockRegister
    };
    /* PORT1_12 (pin 5) is configured as CAN1_RXD */
    PORT_SetPinConfig(PORT1, 12U, &port1_12_pin5_config);

    const port_pin_config_t port1_17_pin10_config = {/* Internal pull-up/down resistor is disabled */
                                                      .pullSelect = kPORT_PullDisable,
                                                      .pullValueSelect = kPORT_LowPullResistor,
                                                      .slewRate = kPORT_FastSlewRate,
                                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                                      .driveStrength = kPORT_LowDriveStrength,
                                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                                     /* Pin is configured as CAN1_TXD */
                                                      .mux = kPORT_MuxAlt11,
                                                      .inputBuffer = kPORT_InputBufferEnable,
                                                      .invertInput = kPORT_InputNormal,
                                                      .lockRegister = kPORT_UnlockRegister
    };
    /* PORT1_17 (pin 10) is configured as CAN1_TXD */
    PORT_SetPinConfig(PORT1, 17U, &port1_17_pin10_config);
#endif /* BSP_USING_CAN1 */
}

void BOARD_InitSLCDPins(void)
{
    uint8_t pin;

    /* LCD_P16~LCD_P31 are routed on PORT0_12~PORT0_27 (Alt9). */
    const port_pin_config_t slcd_pin_config = {
        .pullSelect = kPORT_PullDisable,
        .pullValueSelect = kPORT_LowPullResistor,
        .slewRate = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable = kPORT_OpenDrainDisable,
        .driveStrength = kPORT_LowDriveStrength,
        .driveStrength1 = kPORT_NormalDriveStrength,
        .mux = kPORT_MuxAlt9,
        .inputBuffer = kPORT_InputBufferEnable,
        .invertInput = kPORT_InputNormal,
        .lockRegister = kPORT_UnlockRegister,
    };

    CLOCK_EnableClock(kCLOCK_GatePORT0);
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);

    for (pin = 12U; pin <= 27U; pin++)
    {
        PORT_SetPinConfig(PORT0, pin, &slcd_pin_config);
    }
}
